In [41]:
import sys
import os

In [42]:
path= os.listdir("/home/batuhan")
for i in path:
    print(i)
    if "Untitled" in i:
        os.rename(i, i.replace("Untitled","Data_Cleaning"))

.sudo_as_admin_successful
spark-warehouse
spark
.ipython
.jupyter
.gnome
Music
Documents
Data_Cleaning2.ipynb
.scala_history
.bash_logout
.local
Desktop
intellij
.m2
spark-3.3.0-bin-hadoop3
.java
Public
.cache
.pki
.ivy2
.mozilla
idea-IC-222.4167.29
.idea-build
.IdeaIC2018.2
.sbt
.bash_history
snap
.ipynb_checkpoints
kafka
Pictures
.bashrc
deneme
Untitled.ipynb
Templates
Pysparklar
Eski_scalalar
.python_history
os_hatası_çözümü.ipynb
.thunderbird
apache-maven-3.8.6
.dotty_history
.IdeaIC2018.1
Downloads
IdeaProjects
scala
.config
Videos
.profile
.android
scala2

In [2]:
import findspark
findspark.init()
from pyspark.sql import SparkSession
spark = SparkSession.builder \
.master("local[4]") \
.appName("Data Cleaning") \
.config("spark.executor.memory","4g") \
.config("spark.driver.memory","4g") \
.getOrCreate()

22/10/12 06:00:48 WARN Utils: Your hostname, batuhan-VirtualBox resolves to a loopback address: 127.0.1.1; using 10.0.2.15 instead (on interface enp0s3)
22/10/12 06:00:48 WARN Utils: Set SPARK_LOCAL_IP if you need to bind to another address

Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).

22/10/12 06:00:50 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable

In [3]:
adult_train_df = spark.read \
.option("header","True") \
.option("inferSchema","True") \
.option("sep",",") \
.csv("/home/batuhan/Desktop/datalar/adult.data")

In [4]:
adult_train_df.show(20)

+---+-----------------+--------+-------------+-------------+--------------------+------------------+--------------+-------------------+-------+------------+------------+--------------+--------------+------+
|age|        workclass|  fnlwgt|    education|education_num|      marital_status|        occupation|  relationship|               race|    sex|capital_gain|capital_loss|hours_per_week|native_country|output|
+---+-----------------+--------+-------------+-------------+--------------------+------------------+--------------+-------------------+-------+------------+------------+--------------+--------------+------+
| 39|        State-gov| 77516.0|    Bachelors|         13.0|       Never-married|      Adm-clerical| Not-in-family|              White|   Male|      2174.0|         0.0|          40.0| United-States| <=50K|
| 50| Self-emp-not-inc| 83311.0|    Bachelors|         13.0|  Married-civ-spouse|   Exec-managerial|       Husband|              White|   Male|         0.0|         0.0|          13.0| United-States| <=50K|
| 38|          Private|215646.0|      HS-grad|          9.0|            Divorced| Handlers-cleaners| Not-in-family|              White|   Male|         0.0|         0.0|          40.0| United-States| <=50K|
| 53|          Private|234721.0|         11th|          7.0|  Married-civ-spouse| Handlers-cleaners|       Husband|              Black|   Male|         0.0|         0.0|          40.0| United-States| <=50K|
| 28|          Private|338409.0|    Bachelors|         13.0|  Married-civ-spouse|    Prof-specialty|          Wife|              Black| Female|         0.0|         0.0|          40.0|          Cuba| <=50K|
| 37|          Private|284582.0|      Masters|         14.0|  Married-civ-spouse|   Exec-managerial|          Wife|              White| Female|         0.0|         0.0|          40.0| United-States| <=50K|
| 49|          Private|160187.0|          9th|          5.0| Married-spouse-a...|     Other-service| Not-in-family|              Black| Female|         0.0|         0.0|          16.0|       Jamaica| <=50K|
| 52| Self-emp-not-inc|209642.0|      HS-grad|          9.0|  Married-civ-spouse|   Exec-managerial|       Husband|              White|   Male|         0.0|         0.0|          45.0| United-States|  >50K|
| 31|          Private| 45781.0|      Masters|         14.0|       Never-married|    Prof-specialty| Not-in-family|              White| Female|     14084.0|         0.0|          50.0| United-States|  >50K|
| 42|          Private|159449.0|    Bachelors|         13.0|  Married-civ-spouse|   Exec-managerial|       Husband|              White|   Male|      5178.0|         0.0|          40.0| United-States|  >50K|
| 37|          Private|280464.0| Some-college|         10.0|  Married-civ-spouse|   Exec-managerial|       Husband|              Black|   Male|         0.0|         0.0|          80.0| United-States|  >50K|
| 30|        State-gov|141297.0|    Bachelors|         13.0|  Married-civ-spouse|    Prof-specialty|       Husband| Asian-Pac-Islander|   Male|         0.0|         0.0|          40.0|         India|  >50K|
| 23|          Private|122272.0|    Bachelors|         13.0|       Never-married|      Adm-clerical|     Own-child|              White| Female|         0.0|         0.0|          30.0| United-States| <=50K|
| 32|          Private|205019.0|   Assoc-acdm|         12.0|       Never-married|             Sales| Not-in-family|              Black|   Male|         0.0|         0.0|          50.0| United-States| <=50K|
| 40|          Private|121772.0|    Assoc-voc|         11.0|  Married-civ-spouse|      Craft-repair|       Husband| Asian-Pac-Islander|   Male|         0.0|         0.0|          40.0|             ?|  >50K|
| 34|          Private|245487.0|      7th-8th|          4.0|  Married-civ-spouse|  Transport-moving|       Husband| Amer-Indian-Eskimo|   Male|         0.0|         0.0|          45.0|        Mexico| <=50K|
| 25| Self-emp-not-inc|176756.0|      HS-grad|          9.0|       Never-married|   Farming-fishing|     Own-child|              White|   Male|         0.0|         0.0|          35.0| United-States| <=50K|
| 32|          Private|186824.0|      HS-grad|          9.0|       Never-married| Machine-op-inspct|     Unmarried|              White|   Male|         0.0|         0.0|          40.0| United-States| <=50K|
| 38|          Private| 28887.0|         11th|          7.0|  Married-civ-spouse|             Sales|       Husband|              White|   Male|         0.0|         0.0|          50.0| United-States| <=50K|
| 43| Self-emp-not-inc|292175.0|      Masters|         14.0|            Divorced|   Exec-managerial|     Unmarried|              White| Female|         0.0|         0.0|          45.0| United-States|  >50K|
+---+-----------------+--------+-------------+-------------+--------------------+------------------+--------------+-------------------+-------+------------+------------+--------------+--------------+------+
only showing top 20 rows

In [5]:
adult_test_df = spark.read \
.option("header","True") \
.option("inferSchema","True") \
.option("sep",",") \
.csv("/home/batuhan/Desktop/datalar/adult.test")

In [6]:
adult_test_df.show(5)

+---+----------+--------+-------------+-------------+-------------------+------------------+------------+------+-------+------------+------------+--------------+--------------+-------+
|age| workclass|  fnlwgt|    education|education-num|     marital-status|        occupation|relationship|  race|    sex|capital-gain|capital-loss|hours-per-week|native-country| output|
+---+----------+--------+-------------+-------------+-------------------+------------------+------------+------+-------+------------+------------+--------------+--------------+-------+
| 25|   Private|226802.0|         11th|          7.0|      Never-married| Machine-op-inspct|   Own-child| Black|   Male|         0.0|         0.0|          40.0| United-States| <=50K.|
| 38|   Private| 89814.0|      HS-grad|          9.0| Married-civ-spouse|   Farming-fishing|     Husband| White|   Male|         0.0|         0.0|          50.0| United-States| <=50K.|
| 28| Local-gov|336951.0|   Assoc-acdm|         12.0| Married-civ-spouse|   Protective-serv|     Husband| White|   Male|         0.0|         0.0|          40.0| United-States|  >50K.|
| 44|   Private|160323.0| Some-college|         10.0| Married-civ-spouse| Machine-op-inspct|     Husband| Black|   Male|      7688.0|         0.0|          40.0| United-States|  >50K.|
| 18|         ?|103497.0| Some-college|         10.0|      Never-married|                 ?|   Own-child| White| Female|         0.0|         0.0|          30.0| United-States| <=50K.|
+---+----------+--------+-------------+-------------+-------------------+------------------+------------+------+-------+------------+------------+--------------+--------------+-------+
only showing top 5 rows

# VERİ BİRLEŞTİRME

In [7]:
adult_whole_df = adult_train_df.union(adult_test_df)
adult_whole_df.limit(5).toPandas().head()

,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,output
0,39,State-gov,77516.0,Bachelors,13.0,Never-married,Adm-clerical,Not-in-family,White,Male,2174.0,0.0,40.0,United-States,<=50K
1,50,Self-emp-not-inc,83311.0,Bachelors,13.0,Married-civ-spouse,Exec-managerial,Husband,White,Male,0.0,0.0,13.0,United-States,<=50K
2,38,Private,215646.0,HS-grad,9.0,Divorced,Handlers-cleaners,Not-in-family,White,Male,0.0,0.0,40.0,United-States,<=50K
3,53,Private,234721.0,11th,7.0,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0.0,0.0,40.0,United-States,<=50K
4,28,Private,338409.0,Bachelors,13.0,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0.0,0.0,40.0,Cuba,<=50K

# == VERİ TEMİZLİĞİ AŞAMASI ==

1.HEDEF TÜM SATUNLARDA BOŞLUK KONTROLÜ YAP

In [8]:
from pyspark.sql.functions import *

In [9]:
adult_whole_df1 = adult_whole_df \
.withColumn("workclass", trim(col("workclass"))) \
.withColumn("education", trim(col("education"))) \
.withColumn("marital_status", trim(col("marital_status"))) \
.withColumn("occupation", trim(col("occupation"))) \
.withColumn("relationship", trim(col("relationship"))) \
.withColumn("race", trim(col("race"))) \
.withColumn("sex", trim(col("sex"))) \
.withColumn("native_country", trim(col("native_country"))) \
.withColumn("output", trim(col("output")))

In [10]:
adult_whole_df.count()

48842

In [11]:
adult_whole_df1.count()

48842

GÖRÜNDÜĞÜ GİBİ HİÇ BOŞ SÜTUN OLMADIĞI İÇİN DEĞİŞEN BİR ŞEY OLMADI

# 2.ADIM OUTPUT İÇİNDEKİ "." TEMİZLİĞİ

NEDEN 2. OLARAK BU ADIMI YAPIYORUZ ?
ÇÜNKÜ BU YÜZDEN 4 TANE ÇIKTI VAR BUNU İKİYE DÜŞÜRMEMİZ LAZIM DÜŞÜN BATU SEBEBİNİ HATIRLAYACAKSIN ŞUAN 
BURAYA YAZMAK ÇOK ZOR

. İÇERENLERİ REPLACE İLE DEĞİŞTİRME

In [12]:
adult_whole_df2 = adult_whole_df1 \
.withColumn("output", regexp_replace(col("output"),"<=50K.","<=50K")) \
.withColumn("output", regexp_replace(col("output"), ">50K.",">50K"))

ŞİMDİ İŞLEMLER TAMAM MI DİYE İNCELEYELİM

In [14]:
adult_whole_df2.createOrReplaceTempView("output")
spark.sql(" SELECT output, COUNT(*) from output GROUP BY output LIMIT 10") \
.toPandas().head(10)

  output  count(1)
0  <=50K     37155
1   >50K     11687

# 3. NULL KONTROLÜ

In [15]:
sayac_for_null = 1
for sutun in adult_whole_df2.columns:
    if(adult_whole_df2.filter(col(sutun).isNull()).count() > 0):
        print(sayac_for_nul, ".", sutun, "içinde null var.")
    else:
        print(sayac_for_null, sutun)
    sayac_for_null +=1

1 age

2 workclass
3 fnlwgt
4 education
5 education_num
6 marital_status
7 occupation
8 relationship
9 race
10 sex
11 capital_gain
12 capital_loss
13 hours_per_week
14 native_country
15 output

In [16]:
# DEMEKKİ İÇİNDE HERHANGİ BİR NULL YOQQ FAKAT YUKARIDAKİ KODU ÇÖZÜMLEMEYE ÇALIŞ BATU KINIK

# 4. "?" KONTROLLERİ

In [17]:
sayac_for_question = 1
for sutun in adult_whole_df2.columns:
    if(adult_whole_df2.filter(col(sutun).contains("?")).count() > 0):
        print(sayac_for_question, ",", sutun, "içinde ? var")
    else:
        print(sayac_for_question, sutun)
    sayac_for_question +=1

1 age
2 , workclass içinde ? var
3 fnlwgt
4 education
5 education_num
6 marital_status
7 , occupation içinde ? var
8 relationship
9 race
10 sex
11 capital_gain
12 capital_loss
13 hours_per_week
14 , native_country içinde ? var
15 output

In [20]:
adult_whole_df2.select("workclass","occupation","native_country","output") \
.filter(
    col("workclass").contains("?") |
    col("occupation").contains("?") |
    col("native_country").contains("?") 
    
) \
.groupBy("workclass","occupation","native_country","output").count() \
.orderBy(col("count").desc()) \
.toPandas().head(100)

      workclass       occupation native_country output  count
0             ?                ?  United-States  <=50K   2284
1             ?                ?  United-States   >50K    246
2       Private    Other-service              ?  <=50K    100
3       Private            Sales              ?  <=50K     55
4       Private   Prof-specialty              ?  <=50K     51
..          ...              ...            ...    ...    ...
95    Local-gov  Exec-managerial              ?  <=50K      1
96            ?                ?           Peru  <=50K      1
97  Federal-gov  Protective-serv              ?  <=50K      1
98    Local-gov  Exec-managerial              ?   >50K      1
99            ?                ?    Philippines   >50K      1

[100 rows x 5 columns]

In [ ]:
# Soru işaretlerinin dağılımı ve hedef değişken ilgisi tesadüfi görünüyor. Bu durumda ? işareti içeren satırları
# veri setinden çıkaralım

In [22]:
adult_whole_df3 = adult_whole_df2.filter(~(
    col("workclass").contains("?") |
    col("occupation").contains("?") |
    col("native_country").contains("?") 

))
print(adult_whole_df2.count())
print(adult_whole_df3.count())

48842
45222

In [ ]:
# Yukarıdaki kod ile birlikte ? işareti içeren datalardan kurtulmuş olduk

# 5. ZAYIF SINIFLARIN KALDIRILMASI

In [ ]:
# workclass niteliğinde never-worked ve without-pay sınıfları ve occupation niteliğinde armed-forces sınıfı
# çok az tekrarlanmış. Veri setinden çıkarılabilir

In [28]:
adult_whole_df4 = adult_whole_df3 \
.filter(~(
col("workclass").contains("never-worked") | col("workclass").contains("without-pay") |
    col("occupation").contains("Armed-Forces") | col("native_country").contains("Holand-Netherlands")
))

print(adult_whole_df3.count())
print(adult_whole_df4.count())

45222
45207

# 6. EĞİTİM DURUMLARIYLA İLGİLİ KATEGORİLERİN BİRLEŞTİRİLMESİ

education niteliğindeki ;

1st-4th, 5th-6th, 7th-8th: elementary-school

9th, 10th, 11th, 12th : high school

Master, Doctorae : high-education
    
Bachelors, Some-college : undergraduate
    
sınıfları yukarıdaki gibi birleştirilebilir

In [29]:
adult_whole_df5 = adult_whole_df4.withColumn("education_merged",
when(col("education").isin("1st-4th", "5th-6th", "7th-8th"), "Elementar-School")
.when(col("education").isin("9th", "10th", "11th", "12th"), "High-School")
.when(col("education").isin("Masters,Doctorate"), "Postgraduate")
.when(col("education").isin("Bachelors","Some-college"), "Undergraduate")
.otherwise(col("education"))
                                            )

adult_whole_df5.select("education","education_merged").toPandas().head(20)

       education  education_merged
0      Bachelors     Undergraduate
1      Bachelors     Undergraduate
2        HS-grad           HS-grad
3           11th       High-School
4      Bachelors     Undergraduate
5        Masters           Masters
6            9th       High-School
7        HS-grad           HS-grad
8        Masters           Masters
9      Bachelors     Undergraduate
10  Some-college     Undergraduate
11     Bachelors     Undergraduate
12     Bachelors     Undergraduate
13    Assoc-acdm        Assoc-acdm
14       7th-8th  Elementar-School
15       HS-grad           HS-grad
16       HS-grad           HS-grad
17          11th       High-School
18       Masters           Masters
19     Doctorate         Doctorate

In [ ]:
# Yeni Bir Sütun Ekledik. education_merged, Daha sade

In [34]:
nitelik_siralama = ["workclass","education", "education_merged", "marital_status", "occupation","relationship"
                   ,"sex", "native_country", "age", "fnlwgt", "education_num", "capital_gain", "capital_loss",
                   "hours_per_week","output"]

In [35]:
adult_whole_df6 = adult_whole_df5.select(nitelik_siralama)
adult_whole_df6.toPandas().head()

,workclass,education,education_merged,marital_status,occupation,relationship,sex,native_country,age,fnlwgt,education_num,capital_gain,capital_loss,hours_per_week,output
0,State-gov,Bachelors,Undergraduate,Never-married,Adm-clerical,Not-in-family,Male,United-States,39,77516.0,13.0,2174.0,0.0,40.0,<=50K
1,Self-emp-not-inc,Bachelors,Undergraduate,Married-civ-spouse,Exec-managerial,Husband,Male,United-States,50,83311.0,13.0,0.0,0.0,13.0,<=50K
2,Private,HS-grad,HS-grad,Divorced,Handlers-cleaners,Not-in-family,Male,United-States,38,215646.0,9.0,0.0,0.0,40.0,<=50K
3,Private,11th,High-School,Married-civ-spouse,Handlers-cleaners,Husband,Male,United-States,53,234721.0,7.0,0.0,0.0,40.0,<=50K
4,Private,Bachelors,Undergraduate,Married-civ-spouse,Prof-specialty,Wife,Female,Cuba,28,338409.0,13.0,0.0,0.0,40.0,<=50K

In [36]:
adult_whole_df6 \
.coalesce(1) \
.write \
.mode("overwrite") \
.option("sep",",") \
.option("header","True") \
.csv("/home/batuhan/Desktop/new_adult_data")